 ############################################################################# ##
 # Copyright (C) 2001-2020 Inhand Communications, Inc.
 ############################################################################ ##
 #
 # -------------------------------------------------------------------------- --
 #     AUTHOR                   : EExuke
 #     FILE NAME                : 5_NginxLogSplit.sh
 #     FILE DESCRIPTION         : Linux shell script file
 #     FIRST CREATION DATE      : 2020/07/06
 # --------------------------------------------------------------------------
 #     Version                  : 1.0
 #     Last Change              : 2020/07/06
 ## ************************************************************************** ##
#!/bin/bash
#-----------------------------------------------------------
#                COLOUR VARIABLES
#-----------------------------------------------------------
UNDL="\033[4m"    F6_E="\033[0m"    B_WT="\033[47m"
F_BL="\033[30m"   F_RD="\033[31m"   F_GR="\033[32m"
F_YL="\033[33m"   F_BU="\033[34m"   F_PU="\033[35m"
F_DG="\033[36m"   F_WT="\033[37m"   B_BL="\033[40m"
B_RE="\033[41m"   B_GR="\033[42m"   B_YL="\033[43m"
B_BU="\033[44m"   B_PR="\033[45m"   B_DG="\033[46m"

#-----------------------------------------------------------
#切割 Nginx 日志
#-----------------------------------------------------------
#                  MAIN PROCESS
#-----------------------------------------------------------
# 日志目录
logs_path=/logs/www.ccle.xyz
# 切割日志的时间
logs_date=`date -d "yesterday"+%F`
# 移动日志
mv ${logs_path}/access.log ${logs_path}/access_${logs_date}.log && gzip ${logs_path}/access_${logs_date}.log
# 重新加载nginx程序pid，如果不加载程序会继续向access写日志
kill -USR1 $(cat /usr/local/nginx/logs/nginx.pid
# 加crontab计划任务
1 0 * * * ./5_NginxLogSplit.sh



