 ############################################################################# ##
 # Copyright (C) 2001-2020 Inhand Networks, Inc.
 ############################################################################ ##
 #
 # -------------------------------------------------------------------------- --
 #     AUTHOR                   : EExuke
 #     FILE NAME                : 7_mtimeDeletLog.sh
 #     FILE DESCRIPTION         : Linux shell script file
 #     FIRST CREATION DATE      : 2020/07/22
 # --------------------------------------------------------------------------
 #     Version                  : 1.0
 #     Last Change              : 2020/07/22
 ## ************************************************************************** ##
#!/bin/bash
#-----------------------------------------------------------
#                COLOUR VARIABLES
#-----------------------------------------------------------
UNDL="\033[4m"    F6_E="\033[0m"    B_WT="\033[47m"
F_BL="\033[30m"   F_RD="\033[31m"   F_GR="\033[32m"
F_YL="\033[33m"   F_BU="\033[34m"   F_PU="\033[35m"
F_DG="\033[36m"   F_WT="\033[37m"   B_BL="\033[40m"
B_RE="\033[41m"   B_GR="\033[42m"   B_YL="\033[43m"
B_BU="\033[44m"   B_PR="\033[45m"   B_DG="\033[46m"

#-----------------------------------------------------------
# 使用mtime删除历史文件或日志文件
# Linux 系统文件有三个时间戳分别为 Access time、Modify time、Change time,即 atime、mtime、ctime
# Atime 对文件进行一次读操作,它的访问时间就会改变,比如 cat、more 等操作,但是 stat
#	不会影响这个时间变化;
#	Mtime 文件的内容被最后一次修改的时间,比如 vim 操作;
#	Ctime 当文件的状态被改变的时候,比如权限、用户组等操作,都会改变这个时间;
# 查找 30 天之前的访问日志并进行删除操作
#-----------------------------------------------------------
#                  MAIN PROCESS
#-----------------------------------------------------------
for i in `ls /logs`
do
	cd /logs && find $i -type f -mtime +30 -name "*.log" | xargs rm -f
done

#关于-mtime 的讲解:
#-mtime 0 表示文件修改时间距离当前为 0 天的文件,即距离当前时间不到 1 天(24 小时)以内的文件。
#-mtime 1 表示文件修改时间距离当前为 1 天的文件,即距离当前时间 1 天(24 小时-48 小时)的文件。
#-mtime+1 表示文件修改时间为大于 1 天的文件,即距离当前时间 2 天(48 小时)之外的文件
#-mtime -1 表示文件修改时间为小于 1 天的文件,即距离当前时间 1 天(24 小时)之内的文件

